{
   "prefix": "rb!",
   "botId": "<@711194100212301856>",
   "messages": {
      "JOIN_SERVER_MESSAGE": "Thank you for inviting me to your server!\nHere are 2 examples of how to use this bot\n**Example 1:**\n\nchoose any\n:joy: @RoleName\n:joy_cat: @SecondRole\n\n**Example 2:**\n\nchoose one\n:joy: @RoleNameofFirstOption\n:joy_cat: @RoleNameofSecondOption\n\nUse **@react4role help** to display the help message for this bot\nA channel named 'roles' or a channel with the topic: '@react4role' must be created to use this bot.\nOnly server owners can create a message for choosing roles",
      "ADDED_TO_ROLE_MESSAGE": "You have been given the ",
      "REMOVED_FROM_ROLE_MESSAGE": "You have been removed from the ",
      "BOT_NEEDS_PERMISSION": "react4role does not have permission to add or remove users from this role.\nIf you want to add users to this role the server owner must move the role bot higher than the desired role in the role permissions rankings inside of the server settings menu",
      "USER_ALREADY_A_MEMBER": "You are already a member of ",
      "MULTIPLE_ROLES_ON_CHOOSE_ONE": "You cannot assign yourself to multiple roles on a designated 'CHOOSE ONE' role message",
      "CORRECT_FORMAT_EXAMPLE": "**CORRECT FORMAT EXAMPLE**\n\t@react4role choose any\n\t:emojiForTheRole: @RoleName",
      "INCORRECT_SETMESSAGE_FORMAT": "The '@react4role choose (any|one)' command does not use the correct format.",
      "LACK_OF_ASSOCIATION_REQUIREMENTS": "The reaction message must have at least one line with a role and an associated emoji",
      "ANIMATED_EMOJI_USED": "Emojis used for role association cannot be animated",
      "REACTION_MESSAGE_NOW_INVALID": "The update to the message has made the format invalid and as a result the message can no longer add or remove roles until it is fixed or a new message is created",
      "HELP": "Users can join roles by reacting to a message *you* create. Your message must take the following format, where users can either choose 'one' role or 'any' number of roles. You can edit this message in the future and it will continue to work as expected\n\n@react4role choose (any|one)\n:one: @Role1\n:two: @Role2\n\nRole assignment messages can only be created by the server owner and will only work in teext channels named 'roles' or channels with @react4role somewhere in the channel topic. @react4role will have a role associated with it in this server's settings that needs to be placed higher than the roles you wish to allow it to manipulate"
   }
}